//npm - node package manager

//d: \ c: смена диска в консоли
// cd и путь к файлу - изменение каталога
// dir - список каталогов
//cd .. - возвращается на уровень выше
//npm init - инициализация json файла в проекте с названием файла, ключами запуска, лицензией, автором и т.д.
//cls - очистка консоли
//npm install (или просто npm i <пакет>) bootstrap - установили bootstrap
//npm install - если мы настраиваем новый проект и есть файл джейсон, то нужно просто прописать npm install и он автоматом установит все необходимые модули из блока dependencies (зависимости)

/* {        //файл джейсон, который создался
    "name": "node.js",
    "version": "1.0.0",
    "description": "Yes, that`s right!",
    "main": "app.js",
    "scripts": { //в блоке скрипты находится описание, как запускать проект
      "test": "echo \"Error: no test specified\" && exit 1" //пустая строка
    },
    "keywords": [ //ключевые слова
      "react",
      "light",
      "level"
    ],
    "author": "Yuri",
    "license": "ISC",
    "dependencies": {       //показывает, что проект требует бутстрап определённой версии
    "bootstrap": "^4.3.1",
    "rc-slider": "^8.7.1"
  }
  } */